Repository: maximum-software/pdf-forms-for-woocommerce
Catalog: languages/pdf-forms-for-woocommerce-*.po
Languages: ar, fr_fr, ja

source: PDF Forms Filler for WooCommerce
ar: حشو نماذج PDF لـ WooCommerce
fr_fr: Remplisseur de formulaires PDF pour WooCommerce
ja: WooCommerceのためのPDFフォームフィラー

source: Automatically fill PDF forms with WooCommerce orders and attach generated PDFs to email notifications and order downloads.
ar: املأ النماذج بصيغة PDF تلقائيًا بأوامر WooCommerce وأرفق النماذج بصيغة PDF المُنشأة بإشعارات البريد الإلكتروني وتنزيلات الطلبات.
fr_fr: Remplissez automatiquement les formulaires PDF avec les commandes WooCommerce et joignez les PDF générés aux notifications par e-mail et aux téléchargements de commandes.
ja: WooCommerceの注文でPDFフォームを自動的に入力し、生成されたPDFをEメール通知と注文ダウンロードに添付します。

source: PDF Forms Filler
ar: ملء النماذج بصيغة PDF
fr_fr: Remplisseur de formulaires PDF
ja: PDFフォームフィラー

source: Support
ar: الدعم
fr_fr: Assistance
ja: サポート

source: PDF Forms Filler for WooCommerce Error
ar: خطأ في ملء النماذج بصيغة PDF لـ WooCommerce
fr_fr: Erreur du Remplisseur de formulaires PDF pour WooCommerce
ja: WooCommerceのためのPDFフォームフィラーエラー

source: The required plugin 'WooCommerce' version is not installed!
ar: لم يتم تثبيت الإصدار المطلوب من الإضافة 'WooCommerce'!
fr_fr: La version requise du plugin 'WooCommerce' n'est pas installée !
ja: 必要なプラグイン「WooCommerce」のバージョンがインストールされていません！

source: PDF Forms Filler for WooCommerce Warning
ar: تحذير ملء النماذج بصيغة PDF لـ WooCommerce
fr_fr: Avertissement du Remplisseur de formulaires PDF pour WooCommerce
ja: WooCommerceのためのPDFフォームフィラー警告

source: The currently installed version of 'WooCommerce' plugin ({current-woocommerce-version}) may not be supported by the current version of 'PDF Forms Filler for WooCommerce' plugin ({current-plugin-version}), please switch to 'WooCommerce' plugin version {supported-woocommerce-version} or below to ensure that 'PDF Forms Filler for WooCommerce' plugin would work correctly.
ar: قد لا يتم دعم الإصدار الحالي المثبت من الإضافة 'WooCommerce' ({current-woocommerce-version}) بواسطة الإصدار الحالي من الإضافة 'ملء النماذج بصيغة PDF لـ WooCommerce' ({current-plugin-version})، يرجى الانتقال إلى إصدار الإضافة 'WooCommerce' {supported-woocommerce-version} أو أقل للتأكد من أن الإضافة 'ملء النماذج بصيغة PDF لـ WooCommerce' ستعمل بشكل صحيح.
fr_fr: La version actuellement installée du plugin 'WooCommerce' ({current-woocommerce-version}) peut ne pas être prise en charge par la version actuelle du plugin 'Remplisseur de formulaires PDF pour WooCommerce' ({current-plugin-version}). Veuillez passer à la version {supported-woocommerce-version} du plugin 'WooCommerce' ou à une version inférieure pour garantir le bon fonctionnement du plugin 'Remplisseur de formulaires PDF pour WooCommerce'.
ja: 現在インストールされている「WooCommerce」プラグインのバージョン({current-woocommerce-version})は、'PDF Forms Filler for WooCommerce'プラグインの現在のバージョン({current-plugin-version})でサポートされていない場合があります。'PDF Forms Filler for WooCommerce'プラグインが正しく動作するように、'WooCommerce'プラグインのバージョン{supported-woocommerce-version}以下に切り替えてください。

source: Unknown version
ar: إصدار غير معروف
fr_fr: Version inconnue
ja: 未知のバージョン

source: Clear All Messages
ar: مسح جميع الرسائل
fr_fr: Effacer tous les messages
ja: すべてのメッセージをクリア

source: PDF Forms Filler for WooCommerce Messages
ar: رسائل ملء النماذج بصيغة PDF لـ WooCommerce
fr_fr: Messages du Remplisseur de formulaires PDF pour WooCommerce
ja: WooCommerceのためのPDFフォームフィラーメッセージ

source: Nonce mismatch
ar: عدم تطابق النونس
fr_fr: Non concordance du nonce
ja: Nonceが一致しません

source: Permission denied
ar: تم رفض الإذن
fr_fr: Permission refusée
ja: 許可が拒否されました

source: Invalid email
ar: بريد إلكتروني غير صالح
fr_fr: E-mail invalide
ja: 無効なメール

source: Failed to download file: {error-message}
ar: فشل في تنزيل الملف: {error-message}
fr_fr: Échec du téléchargement du fichier : {error-message}
ja: ファイルのダウンロードに失敗しました: {error-message}

source: Failed to open file for writing
ar: فشل في فتح الملف للكتابة
fr_fr: Échec de l'ouverture du fichier pour l'écriture
ja: 書き込みのためのファイルを開くことができませんでした

source: Failed to create file
ar: فشل في إنشاء الملف
fr_fr: Échec de la création du fichier
ja: ファイルの作成に失敗しました

source: Product settings are stored in orders when they are created. Resetting settings is necessary when new product settings need to be applied to an old order.
ar: يتم تخزين إعدادات المنتج في الطلبات عند إنشائها. إعادة تعيين الإعدادات ضرورية عندما تحتاج إلى تطبيق إعدادات المنتج الجديدة على طلب قديم.
fr_fr: Les paramètres du produit sont stockés dans les commandes lorsqu'elles sont créées. La réinitialisation des paramètres est nécessaire lorsque de nouveaux paramètres de produit doivent être appliqués à une ancienne commande.
ja: 製品の設定は、注文が作成されたときに注文に保存されます。新しい製品の設定を古い注文に適用する必要がある場合、設定をリセットする必要があります。

source: Reset Settings
ar: إعادة تعيين الإعدادات
fr_fr: Réinitialiser les paramètres
ja: 設定をリセット

source: PDFs are refilled when orders status changes. Sometimes you may want to manually trigger PDFs to be refilled after changing some aspect of the order, such as the billing address.
ar: يتم إعادة ملء ملفات PDF عند تغير حالة الطلبات. قد ترغب أحيانًا في تشغيل ملفات PDF يدويًا لإعادة ملئها بعد تغيير جزء معين من الطلب، مثل عنوان الفواتير.
fr_fr: Les PDF sont remplis à nouveau lorsque le statut des commandes change. Parfois, vous pouvez vouloir déclencher manuellement le remplissage des PDF après avoir modifié un aspect de la commande, tel que l'adresse de facturation.
ja: 注文ステータスが変更されると、PDFが再度埋められます。注文の一部、例えば請求先住所を変更した後に、手動でPDFを再度埋めるトリガーをかけたいことがあるかもしれません。

source: Reset PDFs
ar: إعادة تعيين ملفات PDF
fr_fr: Réinitialiser les PDF
ja: PDFをリセット

source: Invalid order ID
ar: معرف الطلب غير صالح
fr_fr: ID de commande invalide
ja: 無効な注文ID

source: Invalid order
ar: طلب غير صالح
fr_fr: Commande invalide
ja: 無効な注文

source: File type {mime-type} of {file} is unsupported for {purpose}
ar: نوع الملف {mime-type} لـ {file} غير مدعوم لـ {purpose}
fr_fr: Le type de fichier {mime-type} de {file} n'est pas pris en charge pour {purpose}
ja: {file}のファイルタイプ{mime-type}は{purpose}には対応していません

source: image embedding
ar: تضمين الصورة
fr_fr: intégration d'image
ja: 画像の埋め込み

source: Attachment file is not accessible
ar: ملف المرفق غير قابل للوصول
fr_fr: Le fichier joint n'est pas accessible
ja: 添付ファイルにアクセスできません

source: [{timestamp}] (order:{order}, product:{product}) Error filling PDFs: {error-message} at {error-file}:{error-line}
ar: [{timestamp}] (الطلب:{order}، المنتج:{product}) خطأ في ملء ملفات PDF: {error-message} في {error-file}:{error-line}
fr_fr: [{timestamp}] (commande:{order}, produit:{product}) Erreur lors du remplissage des PDF : {error-message} dans {error-file}:{error-line}
ja: [{timestamp}] (注文:{order}、製品:{product}) PDFの入力エラー: {error-message}、場所:{error-file}:{error-line}

source: [{timestamp}] (order:{order}) Error filling PDFs for order {order}: {error-message} at {error-file}:{error-line}
ar: [{timestamp}] (الطلب:{order}) خطأ في ملء ملفات PDF للطلب {order}: {error-message} في {error-file}:{error-line}
fr_fr: [{timestamp}] (commande:{order}) Erreur lors du remplissage des PDF pour la commande {order} : {error-message} dans {error-file}:{error-line}
ja: [{timestamp}] (注文:{order}) 注文{order}のPDF入力エラー: {error-message}、場所:{error-file}:{error-line}

source: [{timestamp}] Error filling PDFs: {error-message} at {error-file}:{error-line}
ar: [{timestamp}] خطأ في ملء ملفات PDF: {error-message} في {error-file}:{error-line}
fr_fr: [{timestamp}] Erreur lors du remplissage des PDF : {error-message} dans {error-file}:{error-line}
ja: [{timestamp}] PDFの入力エラー: {error-message}、場所:{error-file}:{error-line}

source: PDF Forms
ar: نماذج PDF
fr_fr: Formulaires PDF
ja: PDFフォーム

source: None
ar: لا شيء
fr_fr: Aucun
ja: なし

source: Create a new downloadable file
ar: إنشاء ملف قابل للتحميل جديد
fr_fr: Créer un nouveau fichier téléchargeable
ja: 新しいダウンロード可能なファイルを作成

source: You can use this section to attach a PDF file to your product and link WooCommerce placeholders to fields in the PDF file. You can also embed images from a URL into the PDF file. Changes here are applied when the product is saved.
ar: يمكنك استخدام هذا القسم لإرفاق ملف PDF بمنتجك وربط عناصر النائبة في WooCommerce بالحقول الموجودة في ملف PDF. يمكنك أيضًا تضمين الصور من عنوان URL في ملف PDF. يتم تطبيق التغييرات هنا عند حفظ المنتج.
fr_fr: Vous pouvez utiliser cette section pour joindre un fichier PDF à votre produit et lier les espaces réservés WooCommerce aux champs du fichier PDF. Vous pouvez également intégrer des images à partir d'une URL dans le fichier PDF. Les modifications ici sont appliquées lorsque le produit est enregistré.
ja: このセクションを使用して、製品にPDFファイルを添付し、WooCommerceのプレースホルダーをPDFファイルのフィールドにリンクすることができます。URLからの画像もPDFファイルに埋め込むことができます。ここでの変更は、製品が保存されたときに適用されます。

source: Attach a PDF File
ar: إرفاق ملف PDF
fr_fr: Joindre un fichier PDF
ja: PDFファイルを添付

source: Delete
ar: حذف
fr_fr: Supprimer
ja: 削除

source: Map Value
ar: قيمة الخريطة
fr_fr: Valeur de la carte
ja: 値をマッピング

source: Options
ar: خيارات
ja: オプション

source: Skip when empty
ar: تخطى عندما يكون فارغًا
fr_fr: Passer lorsque c'est vide
ja: 空の場合はスキップ

source: Attach the filled PDF file to the following emails:
ar: أرفق ملف PDF المملوء بالبريد الإلكتروني التالي:
fr_fr: Joindre le fichier PDF rempli aux e-mails suivants:
ja: 次のメールに入力済みのPDFファイルを添付:

source: Flatten
ar: تسطيح
fr_fr: Aplatir
ja: フラット化

source: New filled PDF file name (placeholders allowed):
ar: اسم الملف الجديد لـ PDF المملوء (يُسمح بالعناصر النائبة):
fr_fr: Nom du nouveau fichier PDF rempli (espaces réservés autorisés) :
ja: 新しい入力済みPDFファイル名（プレースホルダーが使用可能）:

source: Path for saving filled PDF file (placeholders allowed):
ar: مسار حفظ ملف PDF المملوء (يُسمح بالعناصر النائبة):
fr_fr: Chemin pour enregistrer le fichier PDF rempli (espaces réservés autorisés) :
ja: 入力済みPDFファイルを保存するパス（プレースホルダーが使用可能）:

source: Provide a download link to the filled PDF file via the product's downloadable file:
ar: قدم رابط تنزيل لملف PDF المملوء عبر ملف المنتج القابل للتنزيل:
fr_fr: Fournir un lien de téléchargement vers le fichier PDF rempli via le fichier téléchargeable du produit :
ja: 製品のダウンロード可能なファイルを介して、入力済みPDFファイルへのダウンロードリンクを提供する:

source: (leave blank to disable this option)
ar: (اتركه فارغًا لتعطيل هذا الخيار)
fr_fr: (laissez vide pour désactiver cette option)
ja: （このオプションを無効にするには空白のままにしてください）

source: Field Mapper Tool
ar: أداة تخطيط الحقل
fr_fr: Outil de Mappage de Champs
ja: フィールドマッパーツール

source: This tool can be used to link WooCommerce placeholders to fields in the attached PDF files. When an order email notification is sent or downloadable file is requested, text with placeholder data will be inserted into the corresponding fields in the PDF file and the filled PDF will be made available.
ar: يمكن استخدام هذه الأداة لربط العناصر النائبة في WooCommerce بالحقول في ملفات PDF المرفقة. عند إرسال إشعار بريدي للطلب أو طلب ملف قابل للتنزيل، سيتم إدراج النص مع بيانات العنصر النائب في الحقول المقابلة في ملف PDF وسيتم توفير PDF المملوء.
fr_fr: Cet outil peut être utilisé pour lier les espaces réservés WooCommerce aux champs des fichiers PDF joints. Lorsqu'une notification par e-mail de commande est envoyée ou qu'un fichier téléchargeable est demandé, le texte avec les données des espaces réservés sera inséré dans les champs correspondants du fichier PDF et le PDF rempli sera mis à disposition.
ja: このツールは、WooCommerceのプレースホルダーを添付されたPDFファイルのフィールドにリンクするために使用できます。注文のEメール通知が送信されるか、ダウンロード可能なファイルが要求されたとき、プレースホルダーデータを含むテキストがPDFファイルの対応するフィールドに挿入され、入力済みのPDFが利用できるようになります。

source: PDF field
ar: حقل PDF
fr_fr: Champ PDF
ja: PDFフィールド

source: WooCommerce placeholders
ar: العناصر النائبة في WooCommerce
fr_fr: Espaces réservés WooCommerce
ja: WooCommerceのプレースホルダー

source: Add Mapping
ar: أضف تخطيط
fr_fr: Ajouter un Mappage
ja: マッピングを追加

source: Delete All
ar: حذف الكل
fr_fr: Tout Supprimer
ja: すべて削除

source: New Field:
ar: حقل جديد:
fr_fr: Nouveau Champ :
ja: 新しいフィールド:

source: Image Embedding Tool
ar: أداة تضمين الصور
fr_fr: Outil d'Intégration d'Image
ja: 画像埋め込みツール

source: This tool allows embedding of images into PDF files. Images are taken from the provided URLs that may contain placeholders. You can select a PDF file page and draw a bounding box for image insertion. Alternatively, you can insert your image in the center of every page.
ar: تتيح هذه الأداة تضمين الصور في ملفات PDF. يتم أخذ الصور من عناوين URL المقدمة التي قد تحتوي على العناصر النائبة. يمكنك اختيار صفحة ملف PDF ورسم مربع حدودي لإدراج الصورة. بديلًا، يمكنك إدراج صورتك في وسط كل صفحة.
fr_fr: Cet outil permet d'intégrer des images dans des fichiers PDF. Les images proviennent des URL fournies qui peuvent contenir des espaces réservés. Vous pouvez sélectionner une page de fichier PDF et dessiner une zone de délimitation pour l'insertion de l'image. Alternativement, vous pouvez insérer votre image au centre de chaque page.
ja: このツールを使用すると、PDFファイルに画像を埋め込むことができます。画像は、プレースホルダーを含む可能性がある提供されたURLから取得されます。PDFファイルのページを選択して、画像の挿入のための境界ボックスを描画することができます。あるいは、各ページの中央に画像を挿入することもできます。

source: Embed Image
ar: تضمين الصورة
fr_fr: Intégrer une Image
ja: 画像を埋め込む

source: PDF file
ar: ملف PDF
fr_fr: Fichier PDF
ja: PDFファイル

source: Page
ar: صفحة
ja: ページ

source: Select a region where the image needs to be embeded.
ar: حدد منطقة حيث يحتاج إلى تضمين الصورة.
fr_fr: Sélectionnez une région où l'image doit être intégrée.
ja: 画像を埋め込む必要がある領域を選択してください。

source: Top
ar: أعلى
fr_fr: Haut
ja: 上

source: Left
ar: يسار
fr_fr: Gauche
ja: 左

source: Width
ar: العرض
fr_fr: Largeur
ja: 幅

source: Height
ar: الارتفاع
fr_fr: Hauteur
ja: 高さ

source: pts
ar: نقاط

source: Have a question/comment/problem? Feel free to use {a-href-forum}the support forum{/a}.
ar: هل لديك سؤال/تعليق/مشكلة؟ لا تتردد في استخدام {a-href-forum}منتدى الدعم{/a}.
fr_fr: Vous avez une question/commentaire/problème ? N'hésitez pas à utiliser {a-href-forum}le forum de support{/a}.
ja: 質問/コメント/問題がありますか？{a-href-forum}サポートフォーラム{/a}を自由に使用してください。

source: Show Help
ar: إظهار المساعدة
fr_fr: Afficher l'Aide
ja: ヘルプを表示

source: Hide Help
ar: إخفاء المساعدة
fr_fr: Masquer l'aide
ja: ヘルプを非表示

source: Failed to decode data
ar: فشل في فك تشفير البيانات
fr_fr: Échec du décodage des données
ja: データのデコードに失敗しました

source: Error saving PDF form data: {error-message} at {error-file}:{error-line}
ar: خطأ في حفظ بيانات نموذج PDF: {error-message} في {error-file}:{error-line}
fr_fr: Erreur lors de l'enregistrement des données du formulaire PDF : {error-message} à {error-file}:{error-line}
ja: PDFフォームデータの保存中にエラーが発生しました: {error-message} 位置: {error-file}:{error-line}

source: Failed to determine post ID
ar: فشل في تحديد معرف المشاركة
fr_fr: Échec de la détermination de l'ID du post
ja: 投稿IDの特定に失敗しました

source: Failed to load PDF form data
ar: فشل في تحميل بيانات نموذج PDF
fr_fr: Échec du chargement des données du formulaire PDF
ja: PDFフォームデータの読み込みに失敗しました

source: Unknown error
ar: خطأ غير معروف
fr_fr: Erreur inconnue
ja: 未知のエラー

source: Are you sure you want to delete this file? This will delete field mappings and image embeds associated with this file.
ar: هل أنت متأكد من أنك تريد حذف هذا الملف؟ سيتم حذف ربط الحقول وتضمين الصور المرتبطة بهذا الملف.
fr_fr: Êtes-vous sûr de vouloir supprimer ce fichier ? Cela supprimera les mappages de champs et les images intégrées associées à ce fichier.
ja: このファイルを削除してもよろしいですか？ これにより、このファイルに関連するフィールドのマッピングと埋め込み画像が削除されます。

source: Are you sure you want to delete this mapping?
ar: هل أنت متأكد من أنك تريد حذف هذا الربط؟
fr_fr: Êtes-vous sûr de vouloir supprimer ce mappage ?
ja: このマッピングを削除してもよろしいですか？

source: Are you sure you want to delete all mappings?
ar: هل أنت متأكد من أنك تريد حذف جميع التعيينات؟
fr_fr: Êtes-vous sûr de vouloir supprimer tous les mappages ?
ja: すべてのマッピングを削除してもよろしいですか？

source: Are you sure you want to attach a PDF file without any form fields?
ar: هل أنت متأكد من أنك تريد إرفاق ملف PDF بدون أي حقول نموذج؟
fr_fr: Êtes-vous sûr de vouloir joindre un fichier PDF sans aucun champ de formulaire ?
ja: フォームフィールドがないPDFファイルを添付してもよろしいですか？

source: Are you sure you want to delete this embeded image?
ar: هل أنت متأكد من أنك تريد حذف هذه الصورة المضمنة؟
fr_fr: Êtes-vous sûr de vouloir supprimer cette image intégrée ?
ja: この埋め込まれた画像を削除してもよろしいですか？

source: Select a PDF file
ar: اختر ملف PDF
fr_fr: Sélectionner un fichier PDF
ja: PDFファイルを選択

source: Select
ar: اختر
fr_fr: Sélectionner
ja: 選択

source: All PDFs
ar: جميع ملفات PDF
fr_fr: Tous les PDF
ja: すべてのPDF

source: All
ar: الكل
fr_fr: Tout
ja: すべて

source: --- EMPTY ---
ar: --- فارغ ---
fr_fr: --- VIDE ---
ja: --- 空 ---

source: Are you sure you want to reset settings for this order?
ar: هل أنت متأكد من أنك تريد إعادة تعيين الإعدادات لهذا الطلب؟
fr_fr: Êtes-vous sûr de vouloir réinitialiser les paramètres pour cette commande ?
ja: この注文の設定をリセットしてもよろしいですか？

source: Are you sure you want to reset PDFs for this order?
ar: هل أنت متأكد من أنك تريد إعادة تعيين ملفات PDF لهذا الطلب؟
fr_fr: Êtes-vous sûr de vouloir réinitialiser les PDF pour cette commande ?
ja: この注文のPDFをリセットしてもよろしいですか？

source: Invalid attachment ID
ar: معرف المرفق غير صالح
fr_fr: ID de pièce jointe invalide
ja: 無効な添付ID

source: PDF form filling
ar: ملء نموذج PDF
fr_fr: Remplissage du formulaire PDF
ja: PDFフォームの入力

source: Could not read attached file
ar: تعذر قراءة الملف المرفق
fr_fr: Impossible de lire le fichier joint
ja: 添付ファイルを読み込めませんでした

source: No service
ar: لا يوجد خدمة
fr_fr: Aucun service
ja: サービスがありません

source: Failed to determine upload path
ar: فشل في تحديد مسار التحميل
fr_fr: Échec de la détermination du chemin de téléchargement
ja: アップロードパスの特定に失敗しました

source: Invalid page number
ar: رقم الصفحة غير صالح
fr_fr: Numéro de page invalide
ja: 無効なページ番号

source: Failed to retrieve page snapshot
ar: فشل في استرجاع لقطة الصفحة
fr_fr: Échec de la récupération de l'instantané de la page
ja: ページのスナップショットの取得に失敗しました

source: Can't create directory because a file with the same name already exists
ar: لا يمكن إنشاء دليل لأن ملفًا بنفس الاسم موجود بالفعل
fr_fr: Impossible de créer le répertoire car un fichier portant le même nom existe déjà
ja: 同じ名前のファイルが既に存在するため、ディレクトリを作成できません

source: Pdf.Ninja API
ar: واجهة برمجة تطبيقات Pdf.Ninja
fr_fr: API Pdf.Ninja

source: The following form allows you to edit your API settings.
ar: النموذج التالي يتيح لك تعديل إعدادات واجهة برمجة التطبيقات الخاصة بك.
fr_fr: Le formulaire suivant vous permet de modifier vos paramètres d'API.
ja: 以下のフォームを使用して、API設定を編集できます。

source: API Key
ar: مفتاح واجهة برمجة التطبيقات
fr_fr: Clé API
ja: APIキー

source: copy key
ar: نسخ المفتاح
fr_fr: copier la clé
ja: キーをコピー

source: Get new API key
ar: الحصول على مفتاح واجهة برمجة تطبيقات جديد
fr_fr: Obtenir une nouvelle clé API
ja: 新しいAPIキーを取得

source: Get New Key
ar: الحصول على مفتاح جديد
fr_fr: Obtenir une nouvelle clé
ja: 新しいキーを取得

source: API URL
ar: رابط واجهة برمجة التطبيقات
fr_fr: URL de l'API
ja: APIのURL

source: Enter your API URL
ar: أدخل رابط واجهة برمجة التطبيقات الخاص بك
fr_fr: Entrez votre URL d'API
ja: APIのURLを入力してください

source: API version
ar: نسخة واجهة برمجة التطبيقات
fr_fr: Version de l'API
ja: APIバージョン

source: Select API version
ar: اختر نسخة واجهة برمجة التطبيقات
fr_fr: Sélectionnez la version de l'API
ja: APIバージョンを選択

source: Data Security
ar: أمان البيانات
fr_fr: Sécurité des données
ja: データセキュリティ

source: Ignore SSL errors
ar: تجاهل أخطاء SSL
fr_fr: Ignorer les erreurs SSL
ja: SSLエラーを無視する

source: copied!
ar: تم النسخ!
fr_fr: copié!
ja: コピー完了！

source: Failed to get the Pdf.Ninja API key on last attempt.
ar: فشل في الحصول على مفتاح واجهة برمجة التطبيقات Pdf.Ninja في المحاولة الأخيرة.
fr_fr: Échec de l'obtention de la clé API Pdf.Ninja lors de la dernière tentative.
ja: 最後の試みでPdf.Ninja APIキーの取得に失敗しました。

source: Failed to determine the administrator's email address.
ar: فشل في تحديد عنوان البريد الإلكتروني للمسؤول.
fr_fr: Échec de la détermination de l'adresse e-mail de l'administrateur.
ja: 管理者のメールアドレスの確認に失敗しました。

source: Failed to connect to {url}
ar: فشل في الاتصال بـ {url}
fr_fr: Échec de la connexion à {url}
ja: {url}への接続に失敗しました

source: Failed to decode API server response
ar: فشل في فك تشفير رد خادم واجهة برمجة التطبيقات
fr_fr: Échec du décodage de la réponse du serveur API
ja: APIサーバーのレスポンスのデコードに失敗しました

source: Pdf.Ninja API server did not send an expected response
ar: لم يرسل خادم واجهة برمجة التطبيقات Pdf.Ninja الرد المتوقع
fr_fr: Le serveur API Pdf.Ninja n'a pas envoyé de réponse attendue
ja: Pdf.Ninja APIサーバーから期待されるレスポンスが送信されませんでした

source: Failed to download a file from the API server
ar: فشل في تنزيل ملف من خادم واجهة برمجة التطبيقات
fr_fr: Échec du téléchargement d'un fichier depuis le serveur API
ja: APIサーバーからのファイルのダウンロードに失敗しました

source: Unknown attachment URL
ar: رابط المرفق غير معروف
fr_fr: URL de pièce jointe inconnue
ja: 不明な添付ファイルのURL

source: File is not accessible in the local file system
ar: الملف غير قابل للوصول في نظام الملفات المحلي
fr_fr: Le fichier n'est pas accessible dans le système de fichiers local
ja: ファイルはローカルファイルシステムでアクセスできません

source: Failed to encode JSON data
ar: فشل في ترميز بيانات JSON
fr_fr: Échec de l'encodage des données JSON
ja: JSONデータのエンコードに失敗しました

source: Failed to acquire the Pdf.Ninja API key on last attempt. {a-href-edit-service-page}Please retry manually{/a}.
ar: فشل في الحصول على مفتاح API Pdf.Ninja في المحاولة الأخيرة. {a-href-edit-service-page}الرجاء إعادة المحاولة يدويًا{/a}.
fr_fr: Échec de l'obtention de la clé API Pdf.Ninja lors de la dernière tentative. {a-href-edit-service-page}Veuillez réessayer manuellement{/a}.
ja: 最後の試みでPdf.Ninja APIキーの取得に失敗しました。{a-href-edit-service-page}手動で再試行してください{/a}。

source: Warning
ar: تحذير
fr_fr: Avertissement
ja: 警告

source: Your WooCommerce settings indicate that you are using an insecure connection to the Pdf.Ninja API server.
ar: تشير إعدادات WooCommerce الخاصة بك إلى أنك تستخدم اتصالًا غير آمن بخادم API Pdf.Ninja.
fr_fr: Vos paramètres WooCommerce indiquent que vous utilisez une connexion non sécurisée au serveur API Pdf.Ninja.
ja: WooCommerceの設定によれば、Pdf.Ninja APIサーバーへの安全でない接続を使用していることが示されています。

source: Missing feature
ar: ميزة مفقودة
fr_fr: Fonctionnalité manquante
ja: 欠落している機能
